[
  {
    "id": 1,
    "title": "Gran Huelga Ferroviaria",
    "year": 1877,
    "latitude": 39.2904,
    "longitude": -76.6122,
    "description": "La primera gran insurrección obrera en la historia de EE.UU. Inició por recortes salariales en medio de una depresión económica y paralizó el comercio nacional. La violenta respuesta y el uso de tropas federales sentaron un precedente en los conflictos entre capital y trabajo.",
    "image": "/images/gran-huelga-ferroviaria-1877.jpg",
    "modernConnection": "Marcó el inicio de la intervención federal en disputas laborales, una tensión que persiste en los debates actuales sobre el derecho a la huelga, la sindicalización y la economía 'gig'.",
    "significance": 8,
    "tags": ["laboral", "ferrocarriles", "conflicto"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 2,
    "title": "Patente de la Bombilla Eléctrica de Edison",
    "year": 1879,
    "latitude": 40.7589,
    "longitude": -74.4014,
    "description": "Thomas Edison patentó una bombilla incandescente comercialmente viable, catalizando la electrificación de las ciudades y las fábricas. Este avance tecnológico permitió extender la jornada laboral y transformó la vida nocturna y la producción industrial.",
    "image": "/images/patente-bombilla-electrica-de-edison-1879.jpeg",
    "modernConnection": "El modelo de 'fábrica de inventos' de Edison en Menlo Park es el precursor de los modernos laboratorios de I+D corporativos. La electrificación prefigura la construcción de infraestructuras de red como la de internet.",
    "significance": 10,
    "prominent": true,
    "tags": ["tecnología", "innovación", "electricidad"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 3,
    "title": "Formación del Trust Standard Oil",
    "year": 1882,
    "latitude": 41.4993,
    "longitude": -81.6944,
    "description": "John D. Rockefeller consolidó su dominio sobre la industria petrolera creando el Standard Oil Trust, un modelo de monopolio que llegó a controlar cerca del 90% del refino en EE.UU. mediante tácticas agresivas de negocio y una eficiencia implacable.",
    "image": "/images/formacion-del-trust-standard-oil-1882.jpg",
    "modernConnection": "El poder del Standard Oil fue el principal catalizador para la creación de leyes antimonopolio. El debate sobre su poder es el arquetipo de las discusiones actuales sobre la dominancia de mercado de las gigantes tecnológicas (Big Tech).",
    "significance": 10,
    "prominent": true,
    "tags": ["monopolio", "corporativo", "petróleo"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 4,
    "title": "Ley de Comercio Interestatal",
    "year": 1887,
    "latitude": 38.9072,
    "longitude": -77.0369,
    "description": "Primera ley federal significativa para regular la empresa privada. Creó la Comisión de Comercio Interestatal (ICC) para controlar las tarifas abusivas de los ferrocarriles, marcando un giro desde el 'laissez-faire' hacia la supervisión gubernamental.",
    "image": "/images/ley-de-comercio-interestatal-1887.jpg",
    "modernConnection": "Estableció el modelo para las agencias federales de regulación que hoy supervisan sectores clave de la economía, desde las comunicaciones (FCC) hasta las finanzas (SEC).",
    "significance": 8,
    "tags": ["regulación", "gobierno", "ferrocarriles"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 5,
    "title": "Ley Sherman Antitrust",
    "year": 1890,
    "latitude": 38.9072,
    "longitude": -77.0369,
    "description": "El Congreso promulgó la primera ley federal para prohibir explícitamente los monopolios y las 'combinaciones que restrinjan el comercio'. Aunque inicialmente de aplicación débil, se convirtió en la piedra angular de la política antimonopolio de EE.UU.",
    "image": "/images/Ley-Sherman-Antitrust-1890.jpeg",
    "modernConnection": "Sigue siendo la base legal para las demandas antimonopolio modernas contra grandes corporaciones, incluyendo las investigaciones sobre fusiones y el poder de las plataformas digitales.",
    "significance": 10,
    "prominent": true,
    "tags": ["antimonopolio", "ley", "gobierno"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 6,
    "title": "Apertura de Ellis Island",
    "year": 1892,
    "latitude": 40.6995,
    "longitude": -74.0396,
    "description": "Se inauguró la estación federal de inmigración de Ellis Island, procesando a más de 12 millones de inmigrantes que llegaron para proveer la mano de obra esencial para las fábricas y el crecimiento urbano de la nación.",
    "image": "/images/Apertura-de-Ellis-Island-1892.jpg",
    "modernConnection": "Simboliza el debate perenne en EE.UU. sobre la inmigración. Las discusiones actuales sobre política fronteriza, mano de obra y la identidad nacional como 'nación de inmigrantes' tienen sus raíces en esta era.",
    "significance": 8,
    "tags": ["inmigración", "urbanización", "sociedad"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 7,
    "title": "Huelga de Homestead",
    "year": 1892,
    "latitude": 40.407,
    "longitude": -79.911,
    "description": "Una violenta huelga en la acería de Andrew Carnegie en Homestead, Pensilvania. El conflicto entre los trabajadores y los detectives privados de Pinkerton, seguido de la intervención de la milicia estatal, resultó en una derrota aplastante para los sindicatos del acero.",
    "image": "/images/huelga-de-homestead-1892 (1).jpg",
    "modernConnection": "Ejemplifica el desequilibrio de poder entre las grandes corporaciones y el trabajo organizado, un tema que resurge en los esfuerzos de sindicalización en gigantes logísticos y tecnológicos como Amazon.",
    "significance": 9,
    "tags": ["laboral", "acero", "conflicto"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 8,
    "title": "Pánico de 1893",
    "year": 1893,
    "latitude": 40.7128,
    "longitude": -74.006,
    "description": "Una grave crisis económica que provocó quiebras bancarias masivas, desempleo y agitación social. La severidad de la crisis expuso la inestabilidad del sistema financiero industrial y fortaleció las demandas por una reforma monetaria y bancaria.",
    "image": "/images/Panico-de-1893.jpg",
    "modernConnection": "Demostró la necesidad de un banco central para estabilizar la economía, sentando las bases para la creación de la Reserva Federal y prefigurando las respuestas gubernamentales a crisis financieras posteriores como la de 2008.",
    "significance": 8,
    "tags": ["finanzas", "crisis", "economía"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 9,
    "title": "Huelga de Pullman",
    "year": 1894,
    "latitude": 41.6596,
    "longitude": -87.5987,
    "description": "Una huelga nacional de trabajadores ferroviarios que boicotearon los vagones Pullman. El gobierno federal intervino enérgicamente con una orden judicial y tropas, argumentando la necesidad de proteger el correo, lo que supuso otra gran derrota para el movimiento obrero.",
    "image": "/images/Huelga-de-Pullman-1894.jpg",
    "modernConnection": "Estableció el uso de órdenes judiciales como una poderosa herramienta anti-huelga y solidificó el papel del gobierno como garante del comercio interestatal por encima de las demandas laborales, un principio que aún influye en la ley laboral.",
    "significance": 9,
    "tags": ["laboral", "ferrocarriles", "conflicto"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 10,
    "title": "Caso Northern Securities",
    "year": 1904,
    "latitude": 38.9072,
    "longitude": -77.0369,
    "description": "La Corte Suprema ordenó la disolución del trust ferroviario Northern Securities de J.P. Morgan. Fue la primera gran victoria del presidente Theodore Roosevelt como 'destructor de monopolios' y demostró que la Ley Sherman Antitrust podía ser utilizada eficazmente.",
    "image": "/images/Caso-Northern-Securities-1904.jpg",
    "modernConnection": "Es el precedente clave para el uso del poder federal para disolver una empresa por ser demasiado grande y poderosa, un argumento central en las propuestas actuales para 'romper' a las grandes empresas tecnológicas.",
    "significance": 9,
    "tags": ["antimonopolio", "ley", "gobierno"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 11,
    "title": "Publicación de 'La Jungla' de Upton Sinclair",
    "year": 1906,
    "latitude": 41.8781,
    "longitude": -87.6298,
    "description": "Esta novela de investigación ('muckraking') expuso las terribles condiciones sanitarias de la industria empacadora de carne de Chicago. Su impacto fue tan grande que provocó una indignación pública masiva y una demanda de acción gubernamental.",
    "image": "/images/la-jungla-1906.jpg",
    "modernConnection": "Demuestra el poder del periodismo de investigación para impulsar reformas políticas. Es un precursor de los reportajes modernos que exponen abusos en las cadenas de suministro globales o en las industrias alimentarias.",
    "significance": 8,
    "tags": ["muckraking", "regulación", "literatura"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 12,
    "title": "Leyes de Pureza de Alimentos y Medicamentos",
    "year": 1906,
    "latitude": 38.9072,
    "longitude": -77.0369,
    "description": "En respuesta directa a la indignación generada por 'La Jungla', el Congreso aprobó estas leyes pioneras de protección al consumidor, que prohibían los alimentos y medicamentos adulterados y mal etiquetados, y establecían la inspección federal de la carne.",
    "image": "/images/Leyes-de-Pureza-de-Alimentos-y-Medicamentos-1906.jpg",
    "modernConnection": "Estas leyes sentaron las bases para la creación de la moderna Administración de Alimentos y Medicamentos (FDA), la agencia federal encargada de proteger la salud pública en EE.UU.",
    "significance": 9,
    "tags": ["regulación", "consumidor", "gobierno"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 13,
    "title": "Producción del Modelo T de Ford",
    "year": 1908,
    "latitude": 42.3314,
    "longitude": -83.0458,
    "description": "Henry Ford revolucionó la industria con la producción en masa del Modelo T. La línea de ensamblaje móvil no solo hizo el automóvil accesible para la clase media, sino que transformó para siempre los métodos de fabricación y la cultura estadounidense.",
    "image": "/images/Modelo-T-Ford-1908.jpg",
    "modernConnection": "Los principios de la producción en masa de Ford (Fordismo) siguen influyendo en la automatización, la gestión de la cadena de suministro global y la búsqueda de eficiencia en la fabricación a gran escala, como en la producción de vehículos eléctricos.",
    "significance": 10,
    "prominent": true,
    "tags": ["manufactura", "automotriz", "innovación"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 14,
    "title": "Disolución de Standard Oil",
    "year": 1911,
    "latitude": 38.9072,
    "longitude": -77.0369,
    "description": "La Corte Suprema ordenó la disolución del gigantesco trust de Standard Oil en 34 compañías independientes, culminando la lucha antimonopolio de la Era Progresista y afirmando el poder del gobierno federal sobre las corporaciones más grandes.",
    "image": "/images/Disolucion-de-Standard-Oil-1911.png",
    "modernConnection": "Es el caso de disolución corporativa más famoso de la historia y el principal referente citado en los debates contemporáneos sobre si el gobierno debería forzar la división de gigantes tecnológicos como Meta o Google.",
    "significance": 9,
    "tags": ["antimonopolio", "ley", "petróleo"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 15,
    "title": "Incendio en la fábrica Triangle Shirtwaist",
    "year": 1911,
    "latitude": 40.7295,
    "longitude": -73.9965,
    "description": "Un devastador incendio en Nueva York mató a 146 trabajadores textiles, en su mayoría mujeres inmigrantes jóvenes, atrapadas por puertas cerradas y salidas de emergencia inadecuadas. La tragedia expuso el costo humano de la industria no regulada.",
    "image": "/images/Incendio--fabrica-Triangle-Shirtwaist-1911.jpeg",
    "modernConnection": "Fue el catalizador directo para la aprobación de leyes fundamentales sobre seguridad en el lugar de trabajo, códigos de construcción y protección laboral. Su legado se invoca en los debates sobre la seguridad en las cadenas de suministro globales (fast-fashion) y los derechos de los trabajadores.",
    "significance": 10,
    "prominent": true,
    "tags": ["laboral", "seguridad", "tragedia"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 16,
    "title": "Creación de la Reserva Federal",
    "year": 1913,
    "latitude": 38.9072,
    "longitude": -77.0369,
    "description": "Tras una serie de pánicos financieros, el gobierno de EE.UU. creó la Reserva Federal, un sistema bancario central para gestionar la oferta monetaria, estabilizar la economía y supervisar a los bancos del país. Fue la reforma financiera más importante de la era.",
    "image": "/images/Creacion-Reserva-Federal-1913.jpg",
    "modernConnection": "La Reserva Federal ('la Fed') sigue siendo la institución económica más poderosa del país, y sus decisiones sobre las tasas de interés y la política monetaria son fundamentales para controlar la inflación y responder a crisis económicas, como se vio en 2008 y durante la pandemia de COVID-19.",
    "significance": 10,
    "prominent": true,
    "tags": ["finanzas", "regulación", "gobierno"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  },
  {
    "id": 17,
    "title": "Inicio de la Primera Guerra Mundial",
    "year": 1914,
    "latitude": 38.9072,
    "longitude": -77.0369,
    "description": "El estallido de la guerra en Europa marcó el fin de la Era Progresista. Aunque EE.UU. se mantuvo neutral inicialmente, el conflicto demostró la inmensa capacidad industrial que el país había desarrollado, la cual sería decisiva tras su entrada en la guerra en 1917.",
    "image": "/images/Inicio-Primera-Guerra-Mundial-1914.webp",
    "modernConnection": "La movilización industrial para la guerra sentó las bases para la coordinación a gran escala entre el gobierno y la industria, un modelo que se replicaría en el New Deal, la Segunda Guerra Mundial y las políticas económicas de emergencia actuales.",
    "significance": 8,
    "tags": ["guerra", "industria", "geopolítica"],
    "sources": [
      {
        "title": "Building the American Republic, Vol. 2",
        "author": "Dailey",
        "year": 2018
      }
    ]
  }
]
